# 这是一段注释
"""
这也是一段注释
"""
# 适当的添加注释能够使代码变得更易于理解

# 在学习此文件时，你必须先将python语言的编程环境安装到您的计算机内

# 去访问www.python.org下载或在windows下使用该文件夹下的python-3.7.3-amd64.exe文件安装

# 所有基础教程均在此文件内，每个代码知识点运行时的结果我们使用20个=来分隔

# 开始
# ====================
# 一,第一个python程序     hello world
# 学习一门编程语言，大多数人先学习在屏幕上打印hello world
print("一、====================")       # 这是为了运行时分清代码块
# 代码：

print("hello world")

# hello world 使用""包含是为了表示它是一个字符串，print("hello world")表示在屏幕上打印字符串hello world
# 这是一个惯例，python的打印字符串就是如此简单明了,一行解决
print("二、====================")

# 二、有打印语句，即输出语句，自然也有输入语句 使用input

# 这边先说一下什么是变量，变量就像一个名字,
# 比如a = 1 ，a是变量，它是数据1的一个名字，通过访问名字a,就可以访问到数据1
# 我们试一下
a = 1       # 此处定义了一个变量a，将a所对应的值设置为1
print(a)    # print语句，在屏幕上打印a的值
# 这时，我们看到电脑上显示了a所代表的1
